""""""
"""Создайте класс для подсчета площади геометрических
фигур. Класс должен предоставлять функциональность
для подсчета площади треугольника по разным формулам,
площади прямоугольника, площади квадрата, площади
ромба. Методы класса для подсчета площади должны
быть реализованы с помощью статических методов. Также
класс должен считать количество подсчетов площади и
возвращать это значение с помощью статического метода."""

def execute_application():
    pass


if __name__ == "__main__":
    execute_application()